{
  "char2idx": {
    "<pad>": 0,
    "<blank>": 1,
    "<sos>": 2,
    "<eos>": 3,
    "<unk>": 4,
    " ": 5,
    "-": 6,
    "a": 7,
    "b": 8,
    "c": 9,
    "d": 10,
    "e": 11,
    "f": 12,
    "g": 13,
    "h": 14,
    "i": 15,
    "j": 16,
    "k": 17,
    "l": 18,
    "m": 19,
    "n": 20,
    "o": 21,
    "p": 22,
    "q": 23,
    "r": 24,
    "s": 25,
    "t": 26,
    "u": 27,
    "v": 28,
    "w": 29,
    "x": 30,
    "y": 31,
    "z": 32,
    "آ": 33,
    "ؤ": 34,
    "ئ": 35,
    "ا": 36,
    "ب": 37,
    "ت": 38,
    "ج": 39,
    "خ": 40,
    "د": 41,
    "ر": 42,
    "ز": 43,
    "س": 44,
    "ش": 45,
    "غ": 46,
    "ف": 47,
    "ل": 48,
    "م": 49,
    "ن": 50,
    "ه": 51,
    "و": 52,
    "ي": 53,
    "ٹ": 54,
    "پ": 55,
    "چ": 56,
    "ڈ": 57,
    "ڑ": 58,
    "ک": 59,
    "گ": 60,
    "ں": 61,
    "ھ": 62,
    "ہ": 63,
    "ی": 64,
    "ے": 65,
    "ँ": 66,
    "ं": 67,
    "ः": 68,
    "अ": 69,
    "आ": 70,
    "इ": 71,
    "ई": 72,
    "उ": 73,
    "ऊ": 74,
    "ऋ": 75,
    "ए": 76,
    "ऐ": 77,
    "ऑ": 78,
    "ओ": 79,
    "औ": 80,
    "क": 81,
    "ख": 82,
    "ग": 83,
    "घ": 84,
    "ङ": 85,
    "च": 86,
    "छ": 87,
    "ज": 88,
    "झ": 89,
    "ञ": 90,
    "ट": 91,
    "ठ": 92,
    "ड": 93,
    "ढ": 94,
    "ण": 95,
    "त": 96,
    "थ": 97,
    "द": 98,
    "ध": 99,
    "न": 100,
    "प": 101,
    "फ": 102,
    "ब": 103,
    "भ": 104,
    "म": 105,
    "य": 106,
    "र": 107,
    "ऱ": 108,
    "ल": 109,
    "ळ": 110,
    "व": 111,
    "श": 112,
    "ष": 113,
    "स": 114,
    "ह": 115,
    "़": 116,
    "ा": 117,
    "ि": 118,
    "ी": 119,
    "ु": 120,
    "ू": 121,
    "ृ": 122,
    "ॅ": 123,
    "े": 124,
    "ै": 125,
    "ॉ": 126,
    "ो": 127,
    "ौ": 128,
    "्": 129,
    "ঁ": 130,
    "ং": 131,
    "অ": 132,
    "আ": 133,
    "ই": 134,
    "উ": 135,
    "এ": 136,
    "ও": 137,
    "ক": 138,
    "খ": 139,
    "গ": 140,
    "চ": 141,
    "ছ": 142,
    "জ": 143,
    "ট": 144,
    "ঠ": 145,
    "ড": 146,
    "ত": 147,
    "থ": 148,
    "দ": 149,
    "ধ": 150,
    "ন": 151,
    "প": 152,
    "ফ": 153,
    "ব": 154,
    "ম": 155,
    "য": 156,
    "র": 157,
    "ল": 158,
    "শ": 159,
    "স": 160,
    "হ": 161,
    "়": 162,
    "া": 163,
    "ি": 164,
    "ু": 165,
    "ে": 166,
    "ো": 167,
    "্": 168,
    "ৰ": 169,
    "સ": 170,
    "ଂ": 171,
    "ଆ": 172,
    "କ": 173,
    "ଗ": 174,
    "ଜ": 175,
    "ଟ": 176,
    "ଡ": 177,
    "ତ": 178,
    "ଥ": 179,
    "ଦ": 180,
    "ନ": 181,
    "ଫ": 182,
    "ବ": 183,
    "ମ": 184,
    "ର": 185,
    "ଲ": 186,
    "ଵ": 187,
    "ଶ": 188,
    "ଷ": 189,
    "ସ": 190,
    "ହ": 191,
    "ା": 192,
    "ି": 193,
    "ୁ": 194,
    "ୂ": 195,
    "େ": 196,
    "ୈ": 197,
    "ୋ": 198,
    "ஜ": 199
  },
  "idx2char": {
    "0": "<pad>",
    "1": "<blank>",
    "2": "<sos>",
    "3": "<eos>",
    "4": "<unk>",
    "5": " ",
    "6": "-",
    "7": "a",
    "8": "b",
    "9": "c",
    "10": "d",
    "11": "e",
    "12": "f",
    "13": "g",
    "14": "h",
    "15": "i",
    "16": "j",
    "17": "k",
    "18": "l",
    "19": "m",
    "20": "n",
    "21": "o",
    "22": "p",
    "23": "q",
    "24": "r",
    "25": "s",
    "26": "t",
    "27": "u",
    "28": "v",
    "29": "w",
    "30": "x",
    "31": "y",
    "32": "z",
    "33": "آ",
    "34": "ؤ",
    "35": "ئ",
    "36": "ا",
    "37": "ب",
    "38": "ت",
    "39": "ج",
    "40": "خ",
    "41": "د",
    "42": "ر",
    "43": "ز",
    "44": "س",
    "45": "ش",
    "46": "غ",
    "47": "ف",
    "48": "ل",
    "49": "م",
    "50": "ن",
    "51": "ه",
    "52": "و",
    "53": "ي",
    "54": "ٹ",
    "55": "پ",
    "56": "چ",
    "57": "ڈ",
    "58": "ڑ",
    "59": "ک",
    "60": "گ",
    "61": "ں",
    "62": "ھ",
    "63": "ہ",
    "64": "ی",
    "65": "ے",
    "66": "ँ",
    "67": "ं",
    "68": "ः",
    "69": "अ",
    "70": "आ",
    "71": "इ",
    "72": "ई",
    "73": "उ",
    "74": "ऊ",
    "75": "ऋ",
    "76": "ए",
    "77": "ऐ",
    "78": "ऑ",
    "79": "ओ",
    "80": "औ",
    "81": "क",
    "82": "ख",
    "83": "ग",
    "84": "घ",
    "85": "ङ",
    "86": "च",
    "87": "छ",
    "88": "ज",
    "89": "झ",
    "90": "ञ",
    "91": "ट",
    "92": "ठ",
    "93": "ड",
    "94": "ढ",
    "95": "ण",
    "96": "त",
    "97": "थ",
    "98": "द",
    "99": "ध",
    "100": "न",
    "101": "प",
    "102": "फ",
    "103": "ब",
    "104": "भ",
    "105": "म",
    "106": "य",
    "107": "र",
    "108": "ऱ",
    "109": "ल",
    "110": "ळ",
    "111": "व",
    "112": "श",
    "113": "ष",
    "114": "स",
    "115": "ह",
    "116": "़",
    "117": "ा",
    "118": "ि",
    "119": "ी",
    "120": "ु",
    "121": "ू",
    "122": "ृ",
    "123": "ॅ",
    "124": "े",
    "125": "ै",
    "126": "ॉ",
    "127": "ो",
    "128": "ौ",
    "129": "्",
    "130": "ঁ",
    "131": "ং",
    "132": "অ",
    "133": "আ",
    "134": "ই",
    "135": "উ",
    "136": "এ",
    "137": "ও",
    "138": "ক",
    "139": "খ",
    "140": "গ",
    "141": "চ",
    "142": "ছ",
    "143": "জ",
    "144": "ট",
    "145": "ঠ",
    "146": "ড",
    "147": "ত",
    "148": "থ",
    "149": "দ",
    "150": "ধ",
    "151": "ন",
    "152": "প",
    "153": "ফ",
    "154": "ব",
    "155": "ম",
    "156": "য",
    "157": "র",
    "158": "ল",
    "159": "শ",
    "160": "স",
    "161": "হ",
    "162": "়",
    "163": "া",
    "164": "ি",
    "165": "ু",
    "166": "ে",
    "167": "ো",
    "168": "্",
    "169": "ৰ",
    "170": "સ",
    "171": "ଂ",
    "172": "ଆ",
    "173": "କ",
    "174": "ଗ",
    "175": "ଜ",
    "176": "ଟ",
    "177": "ଡ",
    "178": "ତ",
    "179": "ଥ",
    "180": "ଦ",
    "181": "ନ",
    "182": "ଫ",
    "183": "ବ",
    "184": "ମ",
    "185": "ର",
    "186": "ଲ",
    "187": "ଵ",
    "188": "ଶ",
    "189": "ଷ",
    "190": "ସ",
    "191": "ହ",
    "192": "ା",
    "193": "ି",
    "194": "ୁ",
    "195": "ୂ",
    "196": "େ",
    "197": "ୈ",
    "198": "ୋ",
    "199": "ஜ"
  }
}